file = open('E.txt','a')

file.writelines(["1001, Παπαδόπουλος, Γιώργος, Ανδρέας, 2000-05-15, 2101234567, Αθήνας 1, πληροφορική\n",
"1002, Κωνσταντίνου, Μαρία, Δημήτρης, 2001-08-22, 2102345678, Πατησίων 2, μηχανολογία\n",
"1003, Αντωνίου, Κώστας, Πέτρος, 1999-12-10, 2103456789, Σόλωνος 3, πληροφορική\n",
"1004, Δημητρίου, Ελένη, Γιάννης, 2002-03-30, 2104567890, Λεωφ Αλεξάνδρας 4, μηχανολογία\n",
"1005, Νικολάου, Αλέξανδρος, Νίκος, 2000-11-05, 2105678901, Κηφισίας 5, πληροφορική\n",
"1006, Βασιλείου, Σοφία, Αλέξης, 2001-07-18, 2106789012, Πατρών 6, μηχανολογία\n",
"1007, Γεωργίου, Δημήτρης, Γεώργιος, 1998-09-25, 2107890123, Βουλής 7, πληροφορική\n",
"1008, Μιχαηλίδης, Αννα, Μιχάλης, 2003-01-14, 2108901234, Ερμού 8, μηχανολογία\n",
"1009, Οικονόμου, Πέτρος, Σπύρος, 2000-04-12, 2109012345, Ακαδημίας 9, πληροφορική\n",
"1010, Στυλιανίδης, Χριστίνα, Αριστείδης, 2001-06-2, 2110123456, Πλατεία Συντάγματος 10, μηχανολογία\n",
"1011, Αναστασίου, Αθανάσιος, Ιωάννης, 1999-10-03, 2111234567, Λιοσίων 11, πληροφορική\n",
"1012, Παυλίδης, Ευαγγελία, Χρήστος, 2002-02-19, 2112345678, Αγίου Δημητρίου 12, μηχανολογία\n",
"1013, Σωτηρίου, Νικόλαος, Αναστάσιος, 2000-08-08, 2113456789, Κολοκοτρώνη 13, πληροφορική\n",
"1014, Θεοδοσίου, Ιωάννα, Εμμανουήλ, 2001-11-11, 2114567890, Σταδίου 14, μηχανολογία\n",
"1015, Λάμπρου, Αγγελική, Λάμπρος, 2002-12-25, 2115678901, Πανεπιστημίου 15, πληροφορική\n"])
file.close()

file = open('E.txt','r')

word1 = "πληροφορική"
word2 = "μηχανολογία"
count1 = 0
count2 = 0
for line in file:
    words = line.split(",") #spaw ka8e grammh se le3eis
    for i in words:
        if(i.strip()==word1): #me to strip() ka8arizw ta kena kai to \n apo to telos ths grammhs
            count1 += 1
        elif(i.strip()==word2):
            count2 += 1
file.close()
print("Πληροφορική σπουδάζουν ", count1, " άτομα.")
print("Μηχανολογία σπουδάζουν ", count2, " άτομα.")  

file = open('E.txt','r')

mydictionary = {}

for line in file:
    words = line.split(",")
    mydictionary[words[0]]= {
        "surname" : words[1].strip(), "name" : words[2].strip(),
        "telephone" : words[5].strip() , "eidikothta" : words[7].strip()
        }
file.close()

# for x in range(1001,1016):
#     i = str(x)
#     print(i)
#     print(mydictionary[i]["surname"])
#     print(mydictionary[i]["name"])
#     print(mydictionary[i]["telephone"])
#     print(mydictionary[i]["eidikothta"],"\n")

while True:
    id = input("Δώσε αριθμό μητρώου (ή 'exit' για έξοδο): ")
    if id.lower() == 'exit':
        break
    elif id in mydictionary:
        print("Επώνυμο:", mydictionary[id]["surname"])
        print("Όνομα:", mydictionary[id]["name"])
        print("Τηλέφωνο:", mydictionary[id]["telephone"])
        print("Ειδικότητα:", mydictionary[id]["eidikothta"], "\n")
    else:
        print("Ο αριθμός μητρώου δεν βρέθηκε.\n")