Δηλώστε μια μεταβλητή με όνομα challenge και αντιστοιχίστε της μια αρχική τιμή '30 Days Of JavaScript' .
Εκτυπώστε τη συμβολοσειρά στην κονσόλα του προγράμματος περιήγησης χρησιμοποιώντας την console.log()
Εκτυπώστε το μήκος της συμβολοσειράς στην κονσόλα του προγράμματος περιήγησης χρησιμοποιώντας την console.log()
Αλλάξτε όλους τους χαρακτήρες συμβολοσειράς σε κεφαλαία γράμματα χρησιμοποιώντας τη μέθοδο toUpperCase()
Αλλάξτε όλους τους χαρακτήρες συμβολοσειράς σε πεζά γράμματα χρησιμοποιώντας τη μέθοδο toLowerCase()
Κόψτε (τεμαχίστε) την πρώτη λέξη της συμβολοσειράς χρησιμοποιώντας τη μέθοδο substr() ή substring()
Κόψτε τη φράση Days Of JavaScript από το 30 Days Of JavaScript .
Έλεγχος αν η συμβολοσειρά περιέχει μια λέξη. Σενάριο χρησιμοποιώντας τη μέθοδο includes().
Διαχωρίστε τη συμβολοσειρά σε έναν πίνακα χρησιμοποιώντας τη μέθοδο split()
Διαχωρίστε τη συμβολοσειρά 30 Days Of JavaScript στο κενό χρησιμοποιώντας τη μέθοδο split()
Η εντολή 'Facebook, Google, Microsoft, Apple, IBM, Oracle, Amazon' διαχωρίζει τη συμβολοσειρά στο κόμμα και την μετατρέπει σε πίνακα.
Αλλάξτε την τιμή 30 Days Of JavaScript σε 30 Days Of Python χρησιμοποιώντας τη μέθοδο replace() .
Τι είναι ο χαρακτήρας στο ευρετήριο 15 στη συμβολοσειρά '30 Days Of JavaScript'; Χρησιμοποιήστε τη μέθοδο charAt() .
Ποιος είναι ο κωδικός χαρακτήρα του J στη συμβολοσειρά '30 Days Of JavaScript' χρησιμοποιώντας την charCodeAt()
Χρησιμοποιήστε το indexOf για να προσδιορίσετε τη θέση της πρώτης εμφάνισης του a σε 30 ημέρες JavaScript
Χρησιμοποιήστε την συνάρτηση lastIndexOf για να προσδιορίσετε τη θέση της τελευταίας εμφάνισης του a σε 30 Days Of JavaScript.
Χρησιμοποιήστε τη συνάρτηση indexOf για να βρείτε τη θέση της πρώτης εμφάνισης της λέξης επειδή στην ακόλουθη πρόταση: «Δεν μπορείτε να τερματίσετε μια πρόταση με επειδή επειδή το επειδή είναι σύνδεσμος»
Χρησιμοποιήστε τη συνάρτηση lastIndexOf για να βρείτε τη θέση της τελευταίας εμφάνισης της λέξης επειδή στην ακόλουθη πρόταση: «Δεν μπορείτε να τερματίσετε μια πρόταση με επειδή επειδή το επειδή είναι σύνδεσμος»
Χρησιμοποιήστε την αναζήτηση για να βρείτε τη θέση της πρώτης εμφάνισης της λέξης επειδή στην ακόλουθη πρόταση: «Δεν μπορείτε να τελειώσετε μια πρόταση με επειδή επειδή το επειδή είναι σύνδεσμος»
Χρησιμοποιήστε την trim() για να αφαιρέσετε τυχόν κενά διαστήματα στην αρχή και στο τέλος μιας συμβολοσειράς. Π.χ. '30 Ημέρες JavaScript'.
Χρησιμοποιήστε τη μέθοδο startsWith() με τη συμβολοσειρά 30 Days Of JavaScript και κάντε το αποτέλεσμα true
Χρησιμοποιήστε τη μέθοδο endsWith() με τη συμβολοσειρά 30 Days Of JavaScript και κάντε το αποτέλεσμα true.
Χρησιμοποιήστε τη μέθοδο match() για να βρείτε όλα τα a σε 30 ημέρες JavaScript
Χρησιμοποιήστε το concat() και συγχωνεύστε τις λέξεις '30 Days of' και 'JavaScript' σε μία μόνο συμβολοσειρά, '30 Days Of JavaScript'
Χρησιμοποιήστε τη μέθοδο repeat() για να εκτυπώσετε 30 ημέρες JavaScript 2 φορές
Άσκηση: Επίπεδο 2
Χρησιμοποιώντας την console.log() εκτυπώστε την ακόλουθη δήλωση:

The quote 'There is no exercise better for the heart than reaching down and lifting people up.' by John Holmes teaches us to help one another.
Χρησιμοποιώντας την εντολή console.log() εκτυπώστε το ακόλουθο απόσπασμα της Μητέρας Τερέζας:

"Love is not patronizing and charity isn't about pity, it is about love. Charity and love are the same -- with charity you give love, so don't just give money but reach out your hand instead."
Ελέγξτε αν ο τύπος '10' είναι ακριβώς ίσος με 10. Εάν όχι, κάντε τον ακριβώς ίσο.

Ελέγξτε αν το parseFloat('9.8') είναι ίσο με 10, αν όχι, κάντε το ακριβώς ίσο με 10.

Ελέγξτε αν το 'on' βρίσκεται τόσο στην python όσο και στην ορολογία jargon

Ελπίζω αυτό το μάθημα να μην είναι γεμάτο με ορολογία . Ελέγξτε αν υπάρχει ορολογία στην πρόταση.

Δημιουργήστε έναν τυχαίο αριθμό μεταξύ 0 και 100 συμπεριλαμβανομένων.

Δημιουργήστε έναν τυχαίο αριθμό μεταξύ 50 και 100 συμπεριλαμβανομένων.

Δημιουργήστε έναν τυχαίο αριθμό μεταξύ 0 και 255 συμπεριλαμβανομένων.

Αποκτήστε πρόσβαση στους χαρακτήρες συμβολοσειράς 'JavaScript' χρησιμοποιώντας έναν τυχαίο αριθμό.